Masmiseim36/nxpSDK/boards/twrkv31f120m/demo_apps/mc_bldc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC1 (number 71), J16[A40]/J500[9]/FTM0_CH0
  @{ */
#define PINTOOL_PWM_FTM0_CH0_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_PWM_FTM0_CH0_PIN 1U     /*!<@brief PORTC pin index: 1 */
                                        /* @} */

/*! @name PORTC2 (number 72), J16[A39]/J500[11]/FTM0_CH1
  @{ */
#define PINTOOL_PWM_FTM0_CH1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_PWM_FTM0_CH1_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                        /* @} */

/*! @name PORTC5 (number 77), J16[A38]/J500[30]/FTM0_CH2
  @{ */
#define PINTOOL_PWM_FTM0_CH2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_PWM_FTM0_CH2_PIN 5U     /*!<@brief PORTC pin index: 5 */
                                        /* @} */

/*! @name PORTC4 (number 76), J16[A37]/J500[32]/FTM0_CH3
  @{ */
#define PINTOOL_PWM_FTM0_CH3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_PWM_FTM0_CH3_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                        /* @} */

/*! @name PORTD4 (number 97), J16[B40]/J500[34]/FTM0_CH4
  @{ */
#define PINTOOL_PWM_FTM0_CH4_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH4_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                        /* @} */

/*! @name PORTD5 (number 98), J16[B39]/J500[36]/FTM0_CH5
  @{ */
#define PINTOOL_PWM_FTM0_CH5_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH5_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_PWM(void);

/*! @name PORTB0 (number 53), J500[18]/ADC0_SE8/ADC1_SE8
  @{ */
#define PINTOOL_ADC_ADC1_PHA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_ADC_ADC1_PHA_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                        /* @} */

/*! @name ADC0_DP3 (number 20), J500[20]/J16[A29]/ADC1_DP0/ADC0_DP3
  @{ */
/* @} */

/*! @name ADC0_DP0 (number 18), J500[22]/ADC0_DP0/ADC1_DP3
  @{ */
/* @} */

/*! @name PORTB3 (number 56), J16[B30]/J500[10]/ADC0_SE13
  @{ */
#define PINTOOL_ADC_ADC0_VDCB_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_ADC_ADC0_VDCB_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_ADC(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB16 (number 62), J500[7]/J22[2]/UART0_RX_TGTMCU
  @{ */
#define PINTOOL_UART_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                              /* @} */

/*! @name PORTB17 (number 63), J500[5]/J23[2]/UART0_TX_TGTMCU
  @{ */
#define PINTOOL_UART_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*! @name PORTE16 (number 10), J16[B46]/J500[6]/J500[33]/SPI0_PCS0
  @{ */
#define PINTOOL_SPI_SPI0_CS0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_SPI_SPI0_CS0_PIN 16U    /*!<@brief PORTE pin index: 16 */
                                        /* @} */

/*! @name PORTE17 (number 11), J6[12]/J16[B48]/SPI0_SCK
  @{ */
#define PINTOOL_SPI_SPI0_SCK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_SPI_SPI0_SCK_PIN 17U    /*!<@brief PORTE pin index: 17 */
                                        /* @} */

/*! @name PORTE18 (number 12), J6[10]/J16[B45]/SPI0_SOUT
  @{ */
#define PINTOOL_SPI_SPI0_SOUT_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_SPI_SPI0_SOUT_PIN 18U    /*!<@brief PORTE pin index: 18 */
                                         /* @} */

/*! @name PORTE19 (number 13), J6[9]/J16[B44]/SPI0_SIN
  @{ */
#define PINTOOL_SPI_SPI0_SIN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_SPI_SPI0_SIN_PIN 19U    /*!<@brief PORTE pin index: 19 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_SPI(void);

/*! @name PORTC11 (number 83), SW2/LLWU_P11
  @{ */
#define PINTOOL_MISC_SW2_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define PINTOOL_MISC_SW2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_MISC_SW2_PIN 11U    /*!<@brief PORTC pin index: 11 */
                                    /* @} */

/*! @name PORTB2 (number 55), J16[B21]/J500[38]/UART0_RTS
  @{ */
#define PINTOOL_MISC_USER_LED_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define PINTOOL_MISC_USER_LED_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_MISC_USER_LED_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                         /* @} */

/*! @name PORTA5 (number 39), J16[B52]
  @{ */
#define PINTOOL_MISC_DRV_EN_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_DRV_EN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_DRV_EN_PIN 5U     /*!<@brief PORTA pin index: 5 */
                                       /* @} */

/*! @name PORTC7 (number 79), J6[19]/J16[A63]
  @{ */
#define PINTOOL_MISC_DRV_RESET_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define PINTOOL_MISC_DRV_RESET_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_MISC_DRV_RESET_PIN 7U     /*!<@brief PORTC pin index: 7 */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
